---
kind: enumMember
id: F:Autodesk.Revit.DB.WallSweepOrientation.Perpendicular
enum: Autodesk.Revit.DB.WallSweepOrientation
source: html/c290c137-1e53-8d4e-588a-f52d8a62122c.htm
---
# Autodesk.Revit.DB.WallSweepOrientation.Perpendicular

Profile is perpendicular to the wall side face